# Test technique Tectra

Dans ce notebook j'ai éssayé de répondre aux questions demandées dans le le fichier word concernant l'extraction des informations iterréssantes tel que le prix/durée minimale, maximale et moyen de ticket par trajet, ainsi que le prix_moyen/durée moyenne par moyen de transport selon la longueur du trajet.

 les fichiers de données: 
 - **ticket_data.csv** : Contenant un historique de ticket (une ligne => une proposition de ticket sur tictactrip)

 - **cities.csv** les villes desservies par tictactrip (lien grâce aux colonnes o_city (origin_city), d_city (destination_city) de ticket_data)

 - **stations.csv** les stations desservies par tictactrip (lien via o_station, d_station de ticket_data)

 - **providers.csv** infos sur les différents providers (lien via company de ticket_data)

Un provider est une "sous-compagnie". Par exemple TGV et TER sont deux providers de VSC (voyages-sncf).

**Import packages**

Dans ce projet nous allons utiliser les librairies Pandas, Numpy, ainsi googlemaps pour calculer la distance entre le villes

In [2]:
import pandas as pd
import numpy as np
import googlemaps

# Requires API key 
#gmaps = googlemaps.Client(key='AIzaSyDbpnDbrH5hxOhPl-lLCP0CHkpROhFuOcI') #vous deverer avoir votre propre clé API pour ppouvoir utiliser cette fonction

## Lecture des fichiers

NB: dans mon analyse j'ai pris un trajet comme étant un voyage entre deux ville (je n'ai pas analysé par stations) et donc les colonnes o_station, d_station, search_ts, middle_station et other_companies n'ont pas été utilisés

In [3]:
cities=pd.read_csv('./data/cities.csv')
providers=pd.read_csv('./data/providers.csv')
stations=pd.read_csv('./data/stations.csv')
ticket_data=pd.read_csv('./data/ticket_data.csv')

In [17]:
cities

,id,local_name,unique_name,latitude,longitude,population
0,5159,"Padua, Veneto, Italia",padua,45.406435,11.876761,209678.0
1,76,"Barcelona, Cataluña, España",barcelona,41.385064,2.173404,1611822.0
2,81,"Basel, Basel-Stadt, Schweiz",basel,47.593437,7.619812,NaN
3,259,"Erlangen, Bayern, Deutschland",erlangen,49.589674,11.011961,105412.0
4,11979,"Balș, Olt, România",balș,44.353354,24.095672,NaN
...,...,...,...,...,...,...
8035,9964,"Saint-André-lez-Lille, Hauts-de-France, France",saint-andre-lez-lille,50.654250,3.047690,NaN
8036,10863,"Kiev, Шевченківський район, Ukraine",kiev,50.450100,30.523400,NaN
8037,11144,"Brighton, England, UK",brighton,50.822000,-0.137400,NaN
8038,11377,"Manises, Comunitat Valenciana, España",manises,39.493000,-0.462100,NaN
8039,11537,"South Cambridgeshire, England, UK",south-cambridgeshire,52.179600,-0.003400,NaN

In [18]:
providers

,id,company_id,provider_id,name,fullname,has_wifi,has_plug,has_adjustable_seats,has_bicycle,transport_type
0,9,1,NaN,ouibus,Ouibus,True,True,True,False,bus
1,10,2,NaN,deinbus,Deinbus.de,False,False,False,False,bus
2,11,3,NaN,infobus,Infobus,False,False,False,False,bus
3,12,4,NaN,studentAgency,Student Agency,False,False,False,False,bus
4,13,5,NaN,flixbus,Flixbus,True,False,False,False,bus
...,...,...,...,...,...,...,...,...,...,...
222,8384,10,16,thalys,Thalys,True,True,False,True,train
223,8385,11,NaN,bbc,Blablacar,False,False,False,False,carpooling
224,8387,30,NaN,vatry,Vatry,NaN,NaN,NaN,NaN,bus
225,8388,40,NaN,beauval,Beauval,NaN,NaN,NaN,NaN,bus
226,8389,12,NaN,idvroom,idVroom,False,False,False,False,carpooling

In [19]:
stations

,id,unique_name,latitude,longitude
0,1,Aalen (Stuttgarter Straße),48.835296,10.092956
1,2,Aéroport Bordeaux-Mérignac,44.830226,-0.700883
2,3,Aéroport CDG,49.009900,2.559310
3,4,Aéroport de Berlin-Schönefeld,52.389446,13.520345
4,5,Aéroport de Dresden,51.123604,13.764737
...,...,...,...,...
11030,11032,Porto Avda De Los Aliados,41.146922,-8.611122
11031,11033,Rom Ciampino Flughafen Piazzale Leonardo da Vinci,41.804102,12.597110
11032,11034,Sants,41.379892,2.139462
11033,11035,Vozilici D66,45.157136,14.164140
11034,11036,Wien Hotel ibis Vienna Airport,48.123229,16.437528

In [20]:
ticket_data

,id,company,o_station,d_station,departure_ts,arrival_ts,price_in_cents,search_ts,middle_stations,other_companies,o_city,d_city
0,6795025,8385,NaN,NaN,2017-10-13 14:00:00+00,2017-10-13 20:10:00+00,4550,2017-10-01 00:13:31.327+00,NaN,NaN,611,542
1,6795026,9,63.0,1044.0,2017-10-13 13:05:00+00,2017-10-14 06:55:00+00,1450,2017-10-01 00:13:35.773+00,"{149,418}",{13},611,542
2,6795027,8377,5905.0,6495.0,2017-10-13 13:27:00+00,2017-10-14 21:24:00+00,7400,2017-10-01 00:13:40.212+00,"{798,798,6794,6246}","{8377,8376}",611,542
3,6795028,8377,5905.0,6495.0,2017-10-13 13:27:00+00,2017-10-14 11:02:00+00,13500,2017-10-01 00:13:40.213+00,"{798,798,6794,6246}","{8377,8376}",611,542
4,6795029,8381,5905.0,6495.0,2017-10-13 21:46:00+00,2017-10-14 19:32:00+00,7710,2017-10-01 00:13:40.213+00,"{5983,5983}",{8380},611,542
...,...,...,...,...,...,...,...,...,...,...,...,...
74163,6869182,13,279.0,10729.0,2017-10-27 02:30:00+00,2017-10-27 16:00:00+00,2590,2017-10-19 10:35:42.943+00,"{408,408}",{8371},628,562
74164,6869185,9,279.0,304.0,2017-10-27 07:00:00+00,2017-10-27 13:30:00+00,2700,2017-10-19 10:35:42.943+00,"{1105,1105}",{9},628,562
74165,6869187,8371,10642.0,304.0,2017-10-27 08:30:00+00,2017-10-27 15:15:00+00,3000,2017-10-19 10:35:42.943+00,"{1105,1105}",{9},628,562
74166,6869189,13,279.0,304.0,2017-10-27 13:25:00+00,2017-10-27 21:10:00+00,2880,2017-10-19 10:35:42.943+00,"{863,863}",{13},628,562
74167,6869191,8371,10642.0,10729.0,2017-10-27 14:45:00+00,2017-10-27 21:40:00+00,2000,2017-10-19 10:35:42.943+00,"{863,863}",{8371},628,562

In [4]:
ticket_df=ticket_data[['id','company','departure_ts','arrival_ts','price_in_cents','search_ts','o_city','d_city']].dropna()

Nb: Nous allons utiliser juste les colonnes qui nous sont importantes

## Lister tous les trajets possibles

nous avons tout d'abord extrait tous les trajets possibles, et les enregistré dans un tableau de données ['o_city_id','d_city_id']

In [16]:
trajets=ticket_data.groupby(['o_city','d_city']).mean().reset_index()[['o_city','d_city']].values

## Calculer la distance entre les villes

Ensuite nous avons calculer la distance entre les villes en utilisant la fonction distance_matrix de la  librairies googlemaps. Pour utiliser cette fonction nous devons avoir une clé API (key_API) depuis google cloud platform. ceci a été fait et j'ai ensuite enregistré les données dans le fichier **"ticket_df_distance.csv"**.

Nb: j'ai désactivé la clé API sur GCP, c'est pour ça que j'ai désactivé cette cellule.

distances=[]

for trajet in trajets:
    o_cit=ticket_df['o_city']==trajet[0]
    d_cit=ticket_df['d_city']==trajet[1]
    
    origin_latitude=cities[cities['id']==trajet[0]]['latitude'].values[0]
    origin_longitude= cities[cities['id']==trajet[0]]['longitude'].values[0]
    destination_latitude= cities[cities['id']==trajet[1]]['latitude'].values[0]
    destination_longitude= cities[cities['id']==trajet[1]]['longitude'].values[0]

    distance = gmaps.distance_matrix([str(origin_latitude) + " " + str(origin_longitude)], 
                [str(destination_latitude) + " " + str(destination_longitude)], mode='walking')['rows'][0]['elements'][0]
    
    distance = distance['distance']['value']/1000
    for i in range(len(ticket_df[o_cit & d_cit]['id'].tolist())):
        distances.append(distance)
    
    
    
    
ticket_df=ticket_df.sort_values(by = ['o_city', 'd_city'])
ticket_df['distance']=distances
ticket_df.to_csv('./data/ticket_df_distance.csv')

In [14]:
ticket_df_distance=pd.read_csv('./data/ticket_df_distance.csv').drop(['Unnamed: 0'],axis='columns')
ticket_df_distance

,id,company,departure_ts,arrival_ts,price_in_cents,search_ts,o_city,d_city,distance
0,6852888,8376,2017-10-26 04:45:00+00,2017-10-26 13:42:00+00,19300,2017-10-16 07:32:37.641+00,5,23,1163.356
1,6852889,8376,2017-10-26 06:48:00+00,2017-10-26 15:42:00+00,21100,2017-10-16 07:32:37.642+00,5,23,1163.356
2,6852890,8376,2017-10-26 08:49:00+00,2017-10-26 17:42:00+00,20600,2017-10-16 07:32:37.642+00,5,23,1163.356
3,6852891,8376,2017-10-26 13:46:00+00,2017-10-26 22:42:00+00,22000,2017-10-16 07:32:37.642+00,5,23,1163.356
4,6852892,8376,2017-10-26 17:48:00+00,2017-10-27 09:42:00+00,18600,2017-10-16 07:32:37.642+00,5,23,1163.356
...,...,...,...,...,...,...,...,...,...
74163,6828145,8385,2017-10-11 19:00:00+00,2017-10-11 20:10:00+00,600,2017-10-09 16:20:07.027+00,12190,639,95.751
74164,6828146,8385,2017-10-11 19:30:00+00,2017-10-11 20:50:00+00,700,2017-10-09 16:20:07.027+00,12190,639,95.751
74165,6828147,8385,2017-10-11 19:30:00+00,2017-10-11 20:50:00+00,700,2017-10-09 16:20:07.028+00,12190,639,95.751
74166,6828148,8385,2017-10-11 21:40:00+00,2017-10-11 22:50:00+00,600,2017-10-09 16:20:07.028+00,12190,639,95.751
74167,6804918,8372,2017-10-07 19:00:00+00,2017-10-08 04:10:00+00,9800,2017-10-04 11:00:36.459+00,12190,8937,193.801

## Associer le type de transport au trajet

Dans cette cette partie nous avons associé le type de transport à chaque trajet: train:bus: carpooling. pour cela ila fallut extraire la colonne "transport_type" du fichiers providers et l'ajouter dans le dataframe.

In [21]:
company=[]
for i in range(74168):
    cond=providers['id']==ticket_df_distance['company'].values[i]
    company.append(providers[cond]['transport_type'].values[0])

In [22]:
ticket_df_finale=ticket_df_distance
ticket_df_finale['transport_type']=company
ticket_df_finale

,id,company,departure_ts,arrival_ts,price_in_cents,search_ts,o_city,d_city,distance,transport_type
0,6852888,8376,2017-10-26 04:45:00+00,2017-10-26 13:42:00+00,19300,2017-10-16 07:32:37.641+00,5,23,1163.356,train
1,6852889,8376,2017-10-26 06:48:00+00,2017-10-26 15:42:00+00,21100,2017-10-16 07:32:37.642+00,5,23,1163.356,train
2,6852890,8376,2017-10-26 08:49:00+00,2017-10-26 17:42:00+00,20600,2017-10-16 07:32:37.642+00,5,23,1163.356,train
3,6852891,8376,2017-10-26 13:46:00+00,2017-10-26 22:42:00+00,22000,2017-10-16 07:32:37.642+00,5,23,1163.356,train
4,6852892,8376,2017-10-26 17:48:00+00,2017-10-27 09:42:00+00,18600,2017-10-16 07:32:37.642+00,5,23,1163.356,train
...,...,...,...,...,...,...,...,...,...,...
74163,6828145,8385,2017-10-11 19:00:00+00,2017-10-11 20:10:00+00,600,2017-10-09 16:20:07.027+00,12190,639,95.751,carpooling
74164,6828146,8385,2017-10-11 19:30:00+00,2017-10-11 20:50:00+00,700,2017-10-09 16:20:07.027+00,12190,639,95.751,carpooling
74165,6828147,8385,2017-10-11 19:30:00+00,2017-10-11 20:50:00+00,700,2017-10-09 16:20:07.028+00,12190,639,95.751,carpooling
74166,6828148,8385,2017-10-11 21:40:00+00,2017-10-11 22:50:00+00,600,2017-10-09 16:20:07.028+00,12190,639,95.751,carpooling
74167,6804918,8372,2017-10-07 19:00:00+00,2017-10-08 04:10:00+00,9800,2017-10-04 11:00:36.459+00,12190,8937,193.801,bus

## Extraire des infos intéressantes type prix min, moyen et max, durée min/max/moyenne par trajet

Dans cette partie nous allons extraire des infos lié à chaque trajet, tel que : prix min, moyen et max, durée min/max/moyenne. Ainsi, pour chaque trajet nous avons effectué :
- Lister les données lié à tous les tickets de ce trajet,
- Calculer la durée moyenne/maximale/minimale pour ce trajet
- Calculer le prix moyen/maximal/minimal pour ce trajet

Ensuite, nous  avons enregistré ces données dans une liste, en y ajoutant une colonne  regroupant la distance de ce trajet. La dernière étape était d'enregistrer ces données dans un DataFrame et l'afficher.

In [9]:
liste_trajet=[]#dist()#{'prix_min','prix_max','prix_moyen','durée_min','durée_max','durée_moyenne'}

for trajet in trajets:
    
    o_cit=ticket_df_distance['o_city']==trajet[0]
    d_cit=ticket_df_distance['d_city']==trajet[1]
        
    name_o_city=cities[cities['id']==trajet[0]]['local_name'].tolist()[0]
    name_d_city=cities[cities['id']==trajet[1]]['local_name'].tolist()[0]
        
    arrival=pd.to_datetime(ticket_df_distance[o_cit & d_cit]['arrival_ts'])
    departure=pd.to_datetime(ticket_df_distance[o_cit & d_cit]['departure_ts'])
    
    duree_min=str(np.min(arrival-departure))
    duree_max=str(np.max(arrival-departure))
    duree_moyenne=str(np.mean(arrival-departure))
        
    prix_min=np.min(ticket_df_distance[o_cit & d_cit]['price_in_cents'])
    prix_max=np.max(ticket_df_distance[o_cit & d_cit]['price_in_cents'])
    prix_moyen=np.array(np.mean(ticket_df_distance[o_cit & d_cit]['price_in_cents']), dtype=np.float32)
        

    distance = ticket_df_distance[o_cit & d_cit]['distance'].tolist()[0]
    
    liste_trajet.append([trajet[0],trajet[1],name_o_city,name_d_city,prix_min,prix_max,prix_moyen,duree_max,duree_min,duree_moyenne,distance])
#pd.DataFrame(liste_trajet)

In [10]:
df_1=pd.DataFrame(liste_trajet,columns=['id_o','id_d','O_city', 'd_city', 'prix_minimale en centimes','prix_maximale en centimes'
                                   ,'prix_moyen en centimes','durée maxiamle','durée minimale','durée moyenne','distance (km)'])

In [11]:
df_1

,id_o,id_d,O_city,d_city,prix_minimale en centimes,prix_maximale en centimes,prix_moyen en centimes,durée maxiamle,durée minimale,durée moyenne,distance (km)
0,5,23,"Agde, Occitanie, France","Amsterdam, Noord-Holland, Nederland",18600,22000,20320.0,0 days 15:54:00,0 days 08:53:00,0 days 10:18:48,1163.356
1,6,227,"Agen, Nouvelle-Aquitaine, France","Dijon, Bourgogne-Franche-Comté, France",9860,13650,11755.0,0 days 15:01:00,0 days 12:24:00,0 days 13:42:30,570.565
2,6,504,"Agen, Nouvelle-Aquitaine, France","Marseille, Provence-Alpes-Côte d'Azur, France",2000,8920,4042.6667,0 days 12:20:00,0 days 05:36:00,0 days 08:17:24,470.018
3,6,628,"Agen, Nouvelle-Aquitaine, France","Paris, Île-de-France, France",2600,3190,2797.5,0 days 14:30:00,0 days 09:40:00,0 days 12:10:00,592.822
4,6,845,"Agen, Nouvelle-Aquitaine, France","Toulouse, Occitanie, France",700,2420,864.6269,0 days 04:11:00,0 days 01:00:00,0 days 01:19:54.626865,104.880
...,...,...,...,...,...,...,...,...,...,...,...
1432,11938,126,"Puteaux, Île-de-France, France","Bordeaux, Nouvelle-Aquitaine, France",3000,5350,4204.8613,1 days 11:20:00,0 days 05:30:00,0 days 07:25:16.666666,546.855
1433,12124,1064,"Cherbourg-en-Cotentin, Normandie, France","Carcassonne, Occitanie, France",6000,7900,6950.0,0 days 23:10:00,0 days 11:10:00,0 days 17:10:00,877.223
1434,12166,857,"Aéroport Paris-Vatry (Bussy-Lettrée), Grand-Es...","Troyes, Grand-Est, France",5300,5300,5300.0,0 days 21:55:00,0 days 21:55:00,0 days 21:55:00,56.323
1435,12190,639,"Gerona, Cataluña, España","Perpignan, Occitanie, France",600,850,688.8889,0 days 02:40:00,0 days 01:10:00,0 days 01:28:53.333333,95.751
1436,12190,8937,"Gerona, Cataluña, España","Tarragona, CAT, España",9800,9800,9800.0,0 days 09:10:00,0 days 09:10:00,0 days 09:10:00,193.801

## Extraire les différences de prix moyen et durée selon le train, le bus et le covoiturage selon la distance du trajet (0-200km, 201-800km, 800-2000km, 2000+km)

Dans cette partie nous extraire allons des infos lié à chaque type de transport selon la distance, tel que : prix  moyen et max, durée moyenne. Ainsi, établit dans premier lieux nos conditions:
- **0-200km:** la distance du trajet est inférieur à 200km;
- **201-800km:** la distance du trajet est entre 201 et 800 km;
- **801-2000km:** la distance du trajet est entre 801 et 2000 km;
- **2000+km:** la distance du trajet est supérieur à 2001 km.

Ensuite, nous avons calculé pour chacune de ces conditions et pour chaque type de transport **la durée moyenne** et **le prix moyen**, et nous avons enregistré ces données dans un DataFrame.

In [12]:
array_distance=ticket_df_finale['distance']
cond_1= array_distance<=200
cond_2= array_distance>=201
cond_3= array_distance<=800
cond_4= array_distance>=801
cond_5= array_distance<=2000
cond_6= array_distance>=2001
conditions=[['distance<=200',cond_1], ['201<= distance <=800',cond_2 & cond_3],
            ['801<= distance <=2000',cond_4 & cond_5], ['distance>=2001',cond_6]]
#ticket_df[cond_4 & cond_5]

In [13]:
difference_prix=[]

for condition in conditions:
    
    ticket_cond=ticket_df_finale[condition[1]]

    
    bus=ticket_cond['transport_type']=='bus'
    train=ticket_cond['transport_type']=='train'
    carpooling=ticket_cond['transport_type']=='carpooling'
        

        
    arrival_bus=pd.to_datetime(ticket_cond[bus]['arrival_ts'])
    departure_bus=pd.to_datetime(ticket_cond[bus]['departure_ts'])
    
    arrival_train=pd.to_datetime(ticket_cond[train]['arrival_ts'])
    departure_train=pd.to_datetime(ticket_cond[train]['departure_ts']) 
    
    arrival_carpooling=pd.to_datetime(ticket_cond[carpooling]['arrival_ts'])
    departure_carpooling=pd.to_datetime(ticket_cond[carpooling]['departure_ts'])
    

    duree_moyenne_bus=str(np.mean(arrival_bus-departure_bus))
    duree_moyenne_train=str(np.mean(arrival_train-departure_train))
    duree_moyenne_carpooling=str(np.mean(arrival_carpooling-departure_carpooling))
    

    prix_moyen_bus=np.array(np.mean(ticket_cond[bus]['price_in_cents']), dtype=np.float32)
    prix_moyen_train=np.array(np.mean(ticket_cond[train]['price_in_cents']), dtype=np.float32)
    prix_moyen_carpooling=np.array(np.mean(ticket_cond[carpooling]['price_in_cents']), dtype=np.float32)        

    
    difference_prix.append([condition[0],prix_moyen_bus, prix_moyen_train, prix_moyen_carpooling,
                         duree_moyenne_bus, duree_moyenne_train, duree_moyenne_carpooling])

In [14]:
df_2=pd.DataFrame(difference_prix,columns=['Condition',
                        'prix_moyen bus (centimes)', 'prix_moyen train (centimes)', 'prix_moyen carpooling (centimes)',
                         'duree_moyenne_bus', 'duree_moyenne_train', 'duree_moyenne_carpooling'])
df_2

,condition,prix_moyen_bus (centimes),prix_moyen_train (centimes),prix_moyen_carpooling (centimes),duree_moyenne_bus,duree_moyenne_train,duree_moyenne_carpooling
0,distance<=200,2125.712,3111.7053,1098.8378,0 days 10:12:47.748091,0 days 04:22:50.862493,0 days 01:50:36.386651
1,201<= distance <=800,3337.0938,8667.957,3093.767,0 days 13:55:30.123456,0 days 07:20:08.349265,0 days 04:35:20.403258
2,801<= distance <=2000,5734.095,14934.233,7155.4194,1 days 01:39:14.826666,0 days 11:52:54.691075,0 days 10:29:26.568914
3,distance>=2001,9888.714,nan,11250.0,1 days 20:04:25.714285,NaT,0 days 19:07:30